app/controllers/posts_controller.rb

INSERT INTO "posts" ("allowed_clicks", "content", "created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?)  [["allowed_clicks", 1], ["content", "MyText"], ["created_at", Tue, 25 Feb 2014 17:35:20 UTC +00:00], ["title", "MyString"], ["updated_at", Tue, 25 Feb 2014 17:35:20 UTC +00:00], ["url", "MyString"]]
---
  def create
    @post = current_user.posts.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", "abc"], ["updated_at", Tue, 25 Feb 2014 18:12:40 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY current_clicks, updated_at desc LIMIT 1  [["id", "1"]]
---
  def promotion_show
    @post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY current_clicks, updated_at desc LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."current_clicks" DESC LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "current_clicks" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["current_clicks", 1], ["updated_at", Wed, 26 Feb 2014 05:50:24 UTC +00:00]]
---
  def increment_promotion
    ## increment_counter is best way to implement this functionality
    ## but increment_counter skips activerecord validation so we implemented into manual way.

    # Post.increment_counter :current_clicks, params[:id]
    post = Post.where(id: params[:id]).first
    post.update_attributes(:current_clicks => post.current_clicks + 1) if post.present?

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY current_clicks, updated_at desc LIMIT 1  [["id", "1"]]
---
  def set_post
    @post = current_user.posts.where(id: params[:id]).first